{
    "behavioral_questions": [
      {
        "question": "Why do you want to attend this college?"
      },
      {
        "question": "Tell me about a time when you faced a challenge in school and how you overcame it."
      },
      {
        "question": "Describe a situation where you took initiative on a school project or extracurricular activity."
      },
      {
        "question": "What has been your favorite subject in school, and why?"
      },
      {
        "question": "Can you give an example of a time when you had to balance multiple responsibilities?"
      },
      {
        "question": "Tell me about a time when you worked with others on a group project. How did you contribute?"
      },
      {
        "question": "Describe a situation when you had to step out of your comfort zone to achieve something."
      },
      {
        "question": "Tell me about a time when you had to overcome a fear or hesitation. What was the outcome?"
      },
      {
        "question": "What extracurricular activity has had the most impact on you, and why?"
      },
      {
        "question": "Give an example of a time when you helped someone or contributed to your community."
      },
      {
        "question": "Tell me about a time when you set a goal for yourself and how you achieved it."
      },
      {
        "question": "Describe a moment when you felt proud of your academic or personal achievement."
      },
      {
        "question": "Can you share an experience where you had to manage a difficult situation with a peer or teacher?"
      },
      {
        "question": "Tell me about a time when you had to work under pressure to meet a deadline. How did you handle it?"
      },
      {
        "question": "Describe a situation where you demonstrated leadership in your school or community."
      },
      {
        "question": "What is a personal weakness you’ve worked on improving?"
      },
      {
        "question": "Tell me about a time when you learned from a failure or setback."
      },
      {
        "question": "What role have your hobbies or passions played in shaping your academic interests?"
      },
      {
        "question": "Can you give an example of a time when you had to adapt to a new environment or change?"
      },
      {
        "question": "Describe a time when you made a difficult decision. What did you learn from it?"
      }
    ]
  }
  